<?php
//基本配置
return array(
    // +----------------------------------------------------------------------
    // | 开发状态 develop开发  product正式
    // +----------------------------------------------------------------------
    'web_version'=>'develop',
    
    // +----------------------------------------------------------------------
    // | 数据库设置
    // +----------------------------------------------------------------------
    
    //默认数据库设置
    'default_db' => array(
        // 数据库类型
        'type'           => 'mysql',
        // 服务器地址
        'hostname'       => 'localhost',
        // 数据库名
        'database'       => 'test',
        // 数据库用户名
        'username'       => 'root',
        // 数据库密码
        'password'       => '123456',
        // 数据库连接端口
        'hostport'       => '3306',
        // 数据库编码默认采用utf8
        'charset'        => 'utf8'
    ),
    
    // +----------------------------------------------------------------------
    // | 模块设置
    // +----------------------------------------------------------------------
    
    // 默认模块名
    'default_module'        => 'index',
    // 默认控制器名
    'default_controller'    => 'Index',
    // 默认操作名
    'default_action'        => 'index',
    
    
    // +----------------------------------------------------------------------
    // | URL设置 只有兼容模式  $_GET['s']
    // +----------------------------------------------------------------------
    
    // 是否开启路由
    'url_route_on'           => true,
    // URL伪静态后缀
    'url_html_suffix'        => 'html',
    //url第四个参数 -> 用 $_GET['url_id'] 接收
    'url_var_id'             => 'url_id',
    
    
    
);