<?php
return array(
    // +----------------------------------------------------------------------
    // | 开发状态 develop开发 test测试 product正式
    // +----------------------------------------------------------------------
    'web_version'=>'develop',
    
    // +----------------------------------------------------------------------
    // | 数据库设置
    // +----------------------------------------------------------------------
    // 数据库类型
    'type'           => 'mysql',
    // 服务器地址
    'hostname'       => 'localhost',
    // 数据库名
    'database'       => 'newfenboo2015',
    // 数据库用户名
    'username'       => 'root',
    // 数据库密码
    'password'       => '25892326',
    // 数据库连接端口
    'hostport'       => '3306',
    // 数据库编码默认采用utf8
    'charset'        => 'UTF8'
    
);